# Python program practice 1

#### Write a Python program to sum all the items in a list.

In [1]:
def sum_list(lst):
    sum=0
    for i in lst:
        sum+=i
    return sum
    print("sum of the list is",sum)

In [3]:
lst=[1,2,3,17,18,19]

sum_list(lst)

60

Write a Python program to count the number of strings where the string length is 2 or
more and the first and last character are same from a given list of strings

In [36]:
def checkstring(lst):
    string1=list(map(lambda x:True if len(x)>=2 and x[0]==x[-1] else None,lst))
    string1=[x for x in string1 if x]
    count_string=len(string1)
    return count_string

In [37]:
a=['abc', 'xyz', 'aba', '1221','bhgsskknb','aa']
checkstring(a)

4

In [38]:
def checkstring2(lst):
    string1=len([i for i in lst if len(i)>=2 and i[0]==i[-1]])
    return string1

In [39]:
a=['abc', 'xyz', 'aba', '1221','bhgsskknb','aa']
checkstring2(a)

4

#### Write a Python program to remove duplicates from a list.

In [41]:
# Method 1 : Naive method
# In naive method, we simply traverse the list and append the first occurrence of the element in new list
# and ignore all the other occurrences of that particular element

def removeDuplicate(lst):
    res=[]
    for i in lst:
        if i not in res:
            res.append(i)
    return res
        
samp_list = [10, 20, 30, 20, 10, 50, 60, 40, 80, 50, 40]

removeDuplicate(samp_list)

[10, 20, 30, 50, 60, 40, 80]

In [46]:
# Method 2 : Using list comprehension
# This method has working similar to the above method, but this is just a one-liner shorthand of longer method done with the
# help of list comprehension.

def removeDuplicate2(lst):
    res=[]
    [res.append(i) for i in lst if i not in res]
    return res

samp_list = [10, 20, 30, 20, 10, 50, 60, 40, 80, 50, 40]

removeDuplicate2(samp_list)

[10, 20, 30, 50, 60, 40, 80]

In [48]:
# Method 3 : Using set()
# This is the most popular way by which the duplicated are removed from the list.But the main and notable drawback 
# of this approach is that the ordering of the element is lost in this particular method.

print(list(set(samp_list)))

[40, 10, 80, 50, 20, 60, 30]

# Python program practice 2

#### Write a Python program to check if all dictionaries in a list are empty or not.

In [49]:
my_list1 = [{},{},{}]
my_list2 = [{123,2345},{},{}]

In [50]:
print(all(not i for i in my_list1))

True

In [51]:
print(all(not i for i in my_list2))

False

#### Write a Python program to remove duplicates from a list of lists.

In [53]:
num = [[10, 20], [40], [30, 56, 25], [10, 20], [33], [40]]

In [64]:
res=[]
for i in num:
    if i not in res:
        res.append(i)
print(res)

[[10, 20], [40], [30, 56, 25], [33]]

##### Write a Python program to extend a list without append.

In [78]:
x = [103, 320, 430]
y = [403, 503, 603]

In [73]:
x[:0]=y

In [74]:
x

[403, 503, 603, 103, 320, 430]

In [79]:
x=y+x

In [80]:
x

[403, 503, 603, 103, 320, 430]

#### Write a Python program to find the list in a list of lists whose sum of elements is the highest

In [94]:
#method 1
num = [[1,2,3], [4,5,6], [10,11,12], [7,8,9]]
sum_1=[]
[sum_1.append(sum(i))  for i in num]
sum_1
print("list for which max sum of the element of list inside list is",num[sum_1.index(max(sum_1))])

list for which max sum of the element of list inside list is [10, 11, 12]

In [96]:
#Method 2
print(max(num, key=sum))

[10, 11, 12]

#### Write a Python program to access dictionary keyâ€™s element by index.

In [97]:
num = {'stats': 80, 'math': 90, 'algorithm': 86}

In [98]:
list(num)[0]

'stats'

#### Write a Python program to iterate over two lists simultaneously.

In [99]:
num = [1, 2, 3]
color = ['red', 'while', 'black']

In [103]:
for i,j in zip(num,color):
    print("{} is {}".format(i,j))

1 is red
2 is while
3 is black

#### write a program to insert a string at the begining of every elements in a list

In [106]:
num = [1, 2, 3]

new_list= ["This is "+str(i) for i in num]

In [107]:
new_list

['This is 1', 'This is 2', 'This is 3']

In [108]:
#solution
a = [100,123,345,567,789,890,98,876,543,678]
#enter customer before each element
print(['customer{0}'.format(i) for i in a])

['customer100', 'customer123', 'customer345', 'customer567', 'customer789', 'customer890', 'customer98', 'customer876', 'customer543', 'customer678']

#### write a program to take two lists and print if they have at least one common member

In [120]:
l1=[121,222,332,432,125,457]
l2=[125,236,457,678,779] 
    
def common(l1,l2):
    rc=[]
    for i in l1:
        for j in l2:
            if (i==j):
                rc.append(i)
    print(rc)

In [121]:
common(l1,l2)

[125, 457]

In [126]:
rc=[]
[rc.append(i) for i in l1 for j in l2 if (i==j)]
rc

[125, 457]

#### compute all permutations in a list

In [127]:
import itertools
print(list(itertools.permutations([12,22,23])))

[(12, 22, 23), (12, 23, 22), (22, 12, 23), (22, 23, 12), (23, 12, 22), (23, 22, 12)]

# Python Practice 3

In [1]:
# create a dictionary
dict1 = {'data': '123',
'science':'234',
'AI': '235'}

In [59]:
dict1.values()

dict_values([4, 2, 8])

#### write a program to sort a dictionary by key.

In [13]:
def sort_dict(dict):
    for key in sorted(dict.keys()):
        print("%s : %s "%(key,dict[key]))

        
sort_dict(dict1)

AI : 235
data : 123
science : 234

#### Write a Python program to get a dictionary from an object's fields.

In [15]:
class dictObj():
    def __init__(self,x,y,z):
        self.x=x
        self.y=y
        self.z=z
    def demo(self):
        pass

    
test=dictObj("maine","hu","khalnayak")

print(test.__dict__)

{'x': 'maine', 'y': 'hu', 'z': 'khalnayak'}

#### write a program to remove duplicates from Dictionary.

In [25]:
#dictionary
student_data = {'id1':
{'name': ['Sara'],
'class': ['V'],
'subject_integration': ['english, math, science']
},
'id2':
{'name': ['David'],
'class': ['V'],
'subject_integration': ['english, math, science']
},
'id3':
{'name': ['Sara'],
'class': ['V'],
'subject_integration': ['english, math, science']
},
'id4':
{'name': ['Surya'],
'class': ['V'],
'subject_integration': ['english, math, science']
},
}

In [30]:
#solution

test={}

for key,value in student_data.items():
    if value not in test.values():
        test[key]=value

In [55]:
test.values()

dict_values([{'name': ['Sara'], 'class': ['V'], 'subject_integration': ['english, math, science']}, {'name': ['David'], 'class': ['V'], 'subject_integration': ['english, math, science']}, {'name': ['Surya'], 'class': ['V'], 'subject_integration': ['english, math, science']}])

#### write a program to combine two dictionary adding values for common keys

In [47]:
from collections import Counter
d1 = {'a': 1000, 'b': 3200, 'c':1300}
d2 = {'a': 300, 'b': 200, 'd':400}
d = Counter(d1) + Counter(d2)
print(d.items())

# A dictionary has elements as key/value pair, and they are written inside curly brackets.

# Once the dictionary is given to the Counter, it will be converted to a hashtable objects
# wherein the elements will become keys, 
# and the values will be the count of the elements from the dictionary given.

dict_items([('a', 1300), ('b', 3400), ('c', 1300), ('d', 400)])

In [66]:
# write a program to print all unique values from a dictionary in a list
data = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {
"V":"S009"},{"VIII":"S007"}]

In [74]:
vals=[]
for dict_1 in data:
    for val in dict_1.values():
        if val not in vals:
            vals.append(val)

In [76]:
u_value = set( val for dic in data for val in dic.values())
print("Unique Values: ",u_value)

Unique Values:  {'S009', 'S001', 'S007', 'S002', 'S005'}

# Python Practice 4

create a sample JSON object from titanic train dataset
# https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv

In [160]:
import pandas as pd

data_csv=pd.read_csv("https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv")
data_json=data_csv.to_json()

In [161]:
#create a dataframe from the jason object
data_json_1=pd.read_json(data_json)

In [159]:
data_json_1.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
100,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,None,S
101,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,None,S

In [145]:
data_json_1.reset_index(inplace=True)

In [146]:
data_json_1.head()

,index,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
3,100,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,None,S
4,101,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,None,S

In [147]:
data_json_1.columns

Index(['index', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [148]:
data_json_1.drop("index",axis=1,inplace=True)

In [155]:
data_json_1.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
100,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,None,S
101,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,None,S

In [156]:
data_csv.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [162]:
df1=pd.merge(data_csv,data_json_1,indicator=True)

In [164]:
df1 #if indicator is both for all rows then bith data is same

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,_merge
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,both
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,both
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,both
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,both
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,both
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,both
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,both
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,both
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,both
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,both
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,both
11,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,both
12,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,both
13,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,both
14,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,both
15,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,both
16,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,both
17,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,both
18,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,both
19,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,both
20,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,both
21,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q,both
22,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,both
23,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S,both
24,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,both
25,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,both
26,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,both
27,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,both
28,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S,both
29,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,both
...,...,...,...,...,...,...,...,...,...,...,...,...
845,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S,both
846,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,both
847,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,both
848,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S,both
849,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S,both
850,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C,both
851,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S,both
852,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,both
853,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S,both
854,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S,both
855,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,both
856,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,both
857,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S,both
858,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,both
859,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,both
860,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S,both
861,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S,both
862,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,both
863,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,both
864,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,both
865,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,both
866,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,both
867,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S,both
868,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,both
869,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,both
870,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,both
871,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,both
872,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,both
873,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,both
874,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,both

## Create URL to JSON file (alternatively this can be a filepath)
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.jso
n'

In [5]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

import pandas as pd

df=pd.read_json(url,orient="records")

In [6]:
df.head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

# Python Practice 4

In [ ]:
# Create a list of length 3 and Create a list of length 4, For each element in the first list,
# Display the corresponding index element of the second list

In [7]:
header = ['data science', 'Blue mix', 'algorithms']
# Create a list of length 4:
match = ['Red hat', 'Blue mixx','Green gold','Orange Ai']

In [12]:
for i, j in zip(header,match):
    print("'%s'' has match to '%s'"%(i,j))

'data science'' has match to 'Red hat'
'Blue mix'' has match to 'Blue mixx'
'algorithms'' has match to 'Green gold'

In [13]:
# display an example of Nested For Loops Using List Comprehension
# Create a list of length 3:
headers = ['data science', 'Blue mix', 'algorithms']
# Create a list of length 4:
matches = ['Red hat', 'Blue mixx','Green gold','Orange Ai']

In [17]:
[(i,j) for i in headers for j in matches]

[('data science', 'Red hat'),
 ('data science', 'Blue mixx'),
 ('data science', 'Green gold'),
 ('data science', 'Orange Ai'),
 ('Blue mix', 'Red hat'),
 ('Blue mix', 'Blue mixx'),
 ('Blue mix', 'Green gold'),
 ('Blue mix', 'Orange Ai'),
 ('algorithms', 'Red hat'),
 ('algorithms', 'Blue mixx'),
 ('algorithms', 'Green gold'),
 ('algorithms', 'Orange Ai')]

In [18]:
#write a program for breaking and exiting out of loop
# Create a list:
armies = ['Red Army', 'Blue Army', 'Green Army']

In [22]:
for i in armies:
    print(i)
    if i == "Blue Army":
        print("Blue Army found,we will break the loop here")
        break

Red Army
Blue Army
Blue Army found,we will break the loop here

In [ ]:
#A loop will exit when completed, but using an else statement we can add an
#action at the conclusion of the loop if it hasnâ€™t been exited earlier.

In [26]:
for i in armies:
    print(i)
    if i == "Orange Army":
        #print("Blue Army found,we will break the loop here")
        break
else:
    print("we cdnt found the orange army ,so cdnt break the loop")
    #here we are using the for-else loop

Red Army
Blue Army
Green Army
we cdnt found the orange army ,so cdnt break the loop